@danieldreier Thanks for looking into this
I tried to reproduce this from ground up, and the unexpected behaviour happens with your Case 1 if you add `type = map(string)` to the variable environment

```hcl
➜  tf ls
main.tf
➜  tf cat main.tf
variable environment {
  type = map(string)
  default = {}
}

provider "aws" {
  region  = "us-west-2"
}

resource aws_lambda_function this {
  function_name = "test-function"
  s3_bucket = "test-bucket"
  s3_key = "test-function.zip"
  handler = "lambda_function.lambda_handler"
  role = "test-role-arn"
  description = "Managed by Terraform"
  runtime = "python3.8"

  dynamic environment {
    for_each = var.environment != {} ? ["1"] : []

    content {
      variables = var.environment
    }
  }
}
➜  tf      
➜  tf terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Managed by Terraform"
      + function_name                  = "test-function"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "test-role-arn"
      + runtime                        = "python3.8"
      + s3_bucket                      = "test-bucket"
      + s3_key                         = "test-function.zip"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {}

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```